In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.sql import text

In [2]:
engine=create_engine("mssql+pyodbc://DESKTOP-NFGVTDJ\SQLEXPRESS/customersinformation?driver=ODBC+Driver+17+for+sql+server&trusted_connection=yes")

In [3]:
a='''
create table  customers_informate (
        id int primary key,
        employeeid int,
        name varchar(100),
        email varchar(100),
        age int,
        city varchar(100)  
    )
    '''

In [ ]:
with engine.connect() as conn:
    conn.execute(text(a))
    conn.commit()

In [7]:
ab='''
    insert into customers_informate (id,employeeid,name,email,age,city) values 
     (1,1,'ramesh','ramesh@ex.com',14,'hyderabad'),
     (2,2,'ramu','ramu@ex.com',20,'mumbai'),
     (3,3,'raghu','raghu@ex.com',25,'sagar'),
     (4,4,'rahul','rahul@ex.com',26,'srinagar'),
     (5,5,'ram','ram@ex.com',27,'jammu')
    '''

In [8]:
with engine.connect() as conn:
    conn.execute(text(ab))
    conn.commit()

In [15]:
with engine.connect() as conn:
    conn.execute(text('''alter table customers_informate add previousemail varchar(100)'''))
    conn.commit()

In [16]:
with engine.connect() as conn:
    conn.execute(text('''alter table customers_informate add previouscity varchar(100)'''))
    conn.commit()

In [17]:
with engine.connect() as conn:
    conn.execute(text('''update customers_informate  set previousemail=email,previouscity=city where name='ramesh' '''))
    conn.commit()

In [18]:
with engine.connect() as conn:
    conn.execute(text('''update customers_informate  set email='ramesh@example.com',city='orissa' where name='ramesh' '''))
    conn.commit()

In [19]:
pd.read_sql('select * from customers_informate',engine)

,id,employeeid,name,email,age,city,previousemail,previouscity
0,1,1,ramesh,ramesh@example.com,14,orissa,ramesh@ex.com,hyderabad
1,2,2,ramu,ramu@ex.com,20,mumbai,None,None
2,3,3,raghu,raghu@ex.com,25,sagar,None,None
3,4,4,rahul,rahul@ex.com,26,srinagar,None,None
4,5,5,ram,ram@ex.com,27,jammu,None,None